---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DistributionTypeInvalid
source: html/b1690d9e-cbfd-974c-cc81-13311238bec6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DistributionTypeInvalid Property

Selected distribution system type is invalid!

## Syntax (C#)
```csharp
public static FailureDefinitionId DistributionTypeInvalid { get; }
```